using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace LED.Listen.Enums
{
    public enum eInitStyle
    {
        立即显示 = 0,
        随机 = 1,
        左移 = 2,
        右移 = 3,
        上移 = 4,
        下移 = 5,
        连续左移 = 6,
        连续右移 = 7,
        连续上移 = 8,
        连续下移 = 9,
        闪烁 = 10,
        激光字向上 = 11,
        激光字向下 = 12,
        激光字向左 = 13,
        激光字向右 = 14,
        水平交叉拉幕 = 15,
        上下交叉拉幕 = 16,
        左右切入 = 17,
        上下切入 = 18,
        左覆盖 = 19,
        右覆盖 = 20,
        上覆盖 = 21,
        下覆盖 = 22,
        水平百叶左右 = 23,
        水平百叶右左 = 24,
        垂直百叶上下 = 25,
        垂直百叶下上 = 26,
        左右对开 = 27,
        上下对开 = 28,
        左右闭合 = 29,
        上下闭合 = 30,
        向左拉伸 = 31,
        向右拉伸 = 32,
        向上拉伸 = 33,
        向下拉伸 = 34,
        分散向左拉伸 = 35,
        分散向右拉伸 = 36,
        冒泡 = 37,
        下雪 = 38
    }
}
